xebees-maker/Ongoing/Cntl/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Cntl 통합 테스트 2단계: 커스텀 파티션 테이블(fonts LittleFS 파티션 포함), Cntl과 동일
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_FREERTOS_HZ=1000
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MEMTEST=n
# 2026-09-06 — ALWAYSINTERNAL=0은 LVGL 소프트웨어 렌더 태스크("swdraw")가 lv_draw_create_task()
# 에서 매 프레임 draw-task마다 lv_malloc_zeroed()로 만드는 작은 스크래치(수백 바이트, lv_draw.c
# 확인)까지 PSRAM으로 밀어서 렌더링이 watchdog 타임아웃 넘게 느려짐. 기본값(16384)은 원래
# 문제(위젯트리가 내부 RAM 다 먹음)로 되돌아감. 웹 검색 결과(esp32.com 포럼) — 512~1024는
# WiFi-mesh 등이 부적절하게 외부 RAM 할당받아 크래시난 사례 있고, 2048에서 그 문제가
# 해결됐다는 사례 다수 — 커뮤니티에서 수렴한 안정적 중간값으로 2048 채택, 실기 검증 예정
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
# Cntl 통합 테스트 3단계: TinyTTF 런타임 폰트 로드(NanumGothic)
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_TINY_TTF_CACHE_GLYPH_CNT=128
CONFIG_LV_TINY_TTF_CACHE_KERNING_CNT=256

CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OBJ_STYLE_CACHE=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_30=y
# CONFIG_LV_MEM_CUSTOM is not set
# CONFIG_LV_USE_FONT_COMPRESSED is not set
# CONFIG_LV_USE_IMGFONT is not set
# CONFIG_LV_COLOR_SCREEN_TRANSP is not set
# CONFIG_LV_USE_LOG is not set
# CONFIG_LV_LOG_PRINTF is not set
# CONFIG_LV_USE_PERF_MONITOR is not set
# CONFIG_LV_USE_DEMO_BENCHMARK is not set
# CONFIG_LV_USE_DEMO_STRESS is not set
# CONFIG_LV_USE_DEMO_MUSIC is not set
# CONFIG_LV_DEMO_MUSIC_AUTO_PLAY is not set

# 2026-08-29 -- WiFi 이벤트 콜백 체인(찾기 팝업의 실시간 접속 테스트)이 sys_evt
# 태스크 스택에서 스택오버플로우를 일으켜서 확대(기본 2304 -> 6144). 실측
# 크래시 로그로 확인됨: "A stack overflow in task sys_evt has been detected"
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=6144

# 2026-08-30 -- 로고문자 탭 시 대시보드 URL QR코드 팝업 표시용
CONFIG_LV_USE_QRCODE=y
